---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NotAllowedToModifyGroupElementsError
source: html/e9f6aa5d-60ce-d48b-8788-24a7d65dfa5b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NotAllowedToModifyGroupElementsError Property

Connection to a group failed. Modification of elements within a group is not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotAllowedToModifyGroupElementsError { get; }
```